//COBUCLG JOB 1,P,MSGCLASS=X
//        EXEC COBUCLG
//COB.SYSLIB DD DSN=USER.JCL(JCL),DISP=SHR
//SYSPUNCH DD SYSOUT=X
//SYSIN    DD DSN=USER.CBL(HELLO),DISP=SHR
//GO.SYSOUT DD SYSOUT=X